In [5]:
import os
import tempfile

import ibis

In [2]:
ibis.options.interactive = True

In [4]:
!curl -LsS -o /tmp/geography.db \
    'https://storage.googleapis.com/ibis-tutorial-data/geography.db'

In [8]:
conn = ibis.sqlite.connect('/tmp/geography.db')

In [9]:
conn.list_tables()

['countries', 'gdp', 'independence']

In [10]:
countries = conn.table('countries')
countries.columns

['iso_alpha2',
 'iso_alpha3',
 'iso_numeric',
 'fips',
 'name',
 'capital',
 'area_km2',
 'population',
 'continent']

In [11]:
countries['name', 'continent', 'population']

                     name continent  population
0                 Andorra        EU       84000
1    United Arab Emirates        AS     4975593
2             Afghanistan        AS    29121286
3     Antigua and Barbuda        NA       86754
4                Anguilla        NA       13254
..                    ...       ...         ...
247                 Yemen        AS    23495361
248               Mayotte        AF      159042
249          South Africa        AF    49000000
250                Zambia        AF    13460305
251              Zimbabwe        AF    13061000

[252 rows x 3 columns]

In [12]:
countries.count()

252

In [13]:
countries['name', 'continent', 'population'].limit(3)

                   name continent  population
0               Andorra        EU       84000
1  United Arab Emirates        AS     4975593
2           Afghanistan        AS    29121286

In [17]:
countries[['continent']].distinct()

  continent
0        EU
1        AS
2        NA
3        AF
4        AN
5        SA
6        OC

In [18]:
countries['continent'] == 'AS'

0      False
1       True
2       True
3      False
4      False
       ...
247     True
248    False
249    False
250    False
251    False
Name: tmp, Length: 252, dtype: bool

In [22]:
asian_countries = (
    countries['name', 'continent', 'population']
    .filter(countries['continent'] == 'AS'))
asian_countries.limit(5)

                   name continent  population
0  United Arab Emirates        AS     4975593
1           Afghanistan        AS    29121286
2               Armenia        AS     2968000
3            Azerbaijan        AS     8303512
4            Bangladesh        AS   156118464

In [23]:
asian_countries.count()

51

In [26]:
asian_countries.sort_by(ibis.desc('population')).limit(10)

          name continent  population
0        China        AS  1330044000
1        India        AS  1173108018
2    Indonesia        AS   242968342
3     Pakistan        AS   184404791
4   Bangladesh        AS   156118464
5        Japan        AS   127288000
6  Philippines        AS    99900177
7      Vietnam        AS    89571130
8       Turkey        AS    77804122
9         Iran        AS    76923300